[
  {
    "name": "Thorin Oakenshield",
    "description": "Thorin II was born in TA 2746 to Dwarf prince Thráin II in the city of the Lonely Mountain. Early in his youth, he and the other Dwarves of the Lonely Mountain were forced to flee by the dragon Smaug in TA 2770. While in exile, he quickly grew to become a capable warrior. This was demonstrated when he participated in the Battle of Azanulbizar in TA 2799. He fought with one of the Dwarven armies beneath the East-gate of Moria. At some point in the fighting, his shield broke, and using an oaken tree branch found on the ground as a shield, he gained the epithet 'Oakenshield,' which would remain with him even in death.",
    "image_source": "https://static.wikia.nocookie.net/lotr/images/3/3f/ThorinBIG.jpg",
    "url": "thorin"
  },
  {
    "name": "Fili and Kili",
    "description": "Fíli and Kíli were nephews of Thorin, who was the elder brother of their mother, Dís. They were also nephews of Frerin, grandsons of Thráin II, and great-grandsons of Thrór. Fíli's most distinguishing feature was his long nose, the longest of any of the Dwarves in Thorin's company.",
    "image_source": "https://static.wikia.nocookie.net/lotr/images/b/b4/The-Hobbit-Fili-and-Kili.jpg",
    "url": "fill-and-kili"
  },
  {
    "name": "Óin",
    "description": "Óin was the older brother of Glóin, cousin of Dwalin and Balin, and uncle of Gimli. Óin's uncle was Fundin, the father of Balin and Dwalin. Óin fought in the Battle of Azanulbizar along with Thorin Oakenshield, and in TA 2941 joined Thorin's company on the quest to reclaim the Lonely Mountain, wearing a brown hood.[2] Óin was one of the Dwarves who bet that Bilbo would come along with them to reclaim the Lonely Mountain. Óin and his brother Glóin were usually in charge of preparing the fire for the Company, as they were the most skilled of the group. He fought in and survived the Battle of Five Armies, and later settled in the Lonely Mountain with King Dáin II Ironfoot, along with many other Dwarves of the company of Thorin.",
    "image_source": "https://static.wikia.nocookie.net/lotr/images/4/4b/Oinstaff.jpg",
    "url": "oin"
  },
  {
    "name": "Gloin",
    "description": "Glóin was born in TA 2783, after the dragon Smaug desolated Erebor. He was the younger child of Gróin and younger brother of Óin. In TA 2799, Glóin was known to have fought in the Battle of Azanulbizar, the last battle of the War of the Dwarves and Orcs, though it is unknown how significant his contribution was, being 16 years old. In TA 2879, in the Blue Mountains, while in exile, his son Gimli was born to him and an unknown wife. In March of TA 2941 in Bree, Thorin Oakenshield met by chance the wizard Gandalf the Grey, pushing Thorin to reclaim Erebor, so that Smaug wouldn't ally with Sauron. When Gandalf mentioned Hobbits, Glóin referred them as 'simpletons' and also said that Hobbits 'would never dare to come within smelling distance of the nakedest dragonet new from the shell'.",
    "image_source": "https://static.wikia.nocookie.net/lotr/images/f/fc/Gloin_2.jpg",
    "url": "gloin"
  },
  {
    "name": "Balin",
    "description": "Balin was likely born in the Lonely Mountain before the coming of the dragon Smaug. He had a younger brother named Dwalin, and was amongst those driven from their homes when Smaug attacked the Lonely Mountain. Afterwards, he may have lived in Dunland as a refugee, before fighting in the War of the Dwarves and Orcs which culminated in the Battle of Azanulbizar. Many years later, in approximately TA 2841, he accompanied Thráin II, the father of Thorin, when he attempted to go back to the Lonely Mountain himself, but Thráin was captured and lost.",
    "image_source": "https://static.wikia.nocookie.net/lotr/images/5/52/Balin.jpg",
    "url": "balin"
  },
  {
    "name": "Dwalin",
    "description": "Born in TA 2772, two years after the dragon Smaug had desolated Erebor, Dwalin was the son of Fundin and younger brother of Balin. After fighting in the Battle of Azanulbizar at the age of 27, Dwalin accompanied Thráin II and Thorin Oakenshield to settle peacefully in the northern Ered Luin.",
    "image_source": "https://static.wikia.nocookie.net/lotr/images/1/1c/Dwalin.jpg",
    "url": "dwalin"
  },
  {
    "name": "Ori",
    "description": "Ori lived in Thorin's Halls in the northern Blue Mountains for many years. In the year TA 2941, Ori became a member of Thorin's Company and travelled with Thorin, Gandalf, Bilbo Baggins, and the other Dwarves on the quest for the Lonely Mountain, culminating in the death of Smaug. Finally, he and the other Dwarves of Thorin's Company fought in the Battle of Five Armies, which he survived.",
    "image_source": "https://static.wikia.nocookie.net/lotr/images/8/81/Ori.jpeg",
    "url": "ori"
  },
  {
    "name": "Dori",
    "description": "Before the Quest of Erebor, Dori lived in Thorin's Halls in the northern Blue Mountains with Nori and Ori. In TA 2941, the three became part of Thorin and Company, befriending Bilbo Baggins and traveling with him in search of Smaug's treasure at the Lonely Mountain.",
    "image_source": "https://static.wikia.nocookie.net/lotr/images/4/44/Doriinpeterjacksonsthehobbit.jpg",
    "url": "dori"
  },
  {
    "name": "Nori",
    "description": "Nori, as was his brother Dori, was a capable flutist, and both seem to have carried their flutes with them. Both shared Bilbo's liking for regular meals. Before the Quest for the Lonely Mountain, Nori lived in Thorin's Halls in the northern Blue Mountains with his two brothers.",
    "image_source": "https://static.wikia.nocookie.net/lotr/images/5/50/Untitled-31.png",
    "url": "nori"
  },
  {
    "name": "Bifur",
    "description": "Whilst he was a descendant of the Dwarves of Khazad-dûm, Bifur was not related to the royal House of Durin. Most of his familial relations are unclear, and what is known of his parentage is very little. He and his family were driven out of their home in the Lonely Mountain by the dragon Smaug, and were forced to live in exile, where the Dwarf warrior worked as a toy maker. Following Thorin II Oakenshield to a new life at his halls in the Blue Mountains, he continued his life as a toy maker.",
    "image_source": "https://static.wikia.nocookie.net/lotr/images/7/73/Bifur_2.jpg",
    "url": "bifur"
  },
  {
    "name": "Bofur",
    "description": "Bofur was not related to the royal House of Durin but was descended from the Dwarves of Khazad-dûm. While answering Thorin Oakenshield's quest to Erebor, Bofur went to the meeting at Bag End with his brother Bombur and cousin Bifur. He accompanied Thorin, Gandalf, Bilbo Baggins, and rest of Thorin's Company across Wilderland to the Lonely Mountain in order to reclaim the Dwarves' treasure from the dragon Smaug. Following the dragon's demise, Bofur participated in and survived the Battle of Five Armies, receiving his fourteenth share of the treasure as agreed upon.",
    "image_source": "https://static.wikia.nocookie.net/lotr/images/e/ef/Bofurmattock.jpg",
    "url": "bofur"
  },
  {
    "name": "Bombur",
    "description": "Bombur's parentage is unknown. He was the brother of Bofur and cousin of Bifur. Bombur was not of Durin's line, although he was descended from the Dwarves of Khazad-dûm. His birth date is unknown, though it fell somewhere between TA 2763 and TA 2859; the brothers Fíli and Kíli were the youngest of the thirteen 'by some fifty years,' and, after Thorin was captured, Balin was 'the eldest left.' Fíli was born in TA 2859, and Balin was born in TA 2763. Bombur was thus roughly 150 years old during the quest. Prior to the journey, Bombur likely resided in the Blue Mountains alongside Thorin, after the loss of Thráin II.",
    "image_source": "https://static.wikia.nocookie.net/lotr/images/e/ed/Bombur.jpg",
    "url": "bombur"
  },
  {
    "name": "Gandalf",
    "description": "Originally called Olórin, he was accounted as the wisest of the Maiar. He was created by Ilúvatar before the Music of the Ainur[1], and was at the beginning of Time amongst the Ainur who entered into Eä.[2] In his 'youth' he became one of the Maiar who served Manwë, Varda, Irmo, and Nienna. He was associated with light and fire, much like Varda[3], yet his ways often took him to Nienna, from whom he learned pity and patience. He loved the Elves, but walked unseen among them, or wore the guise of an Elf, and sent them fair visions in their hearts that made them wiser. Throughout his life he followed the example of Nienna, talking pity on the sorrows of the Children of Ilúvatar and drawing those who listened to him out of despair.",
    "image_source": "https://static.wikia.nocookie.net/lotr/images/e/e7/Gandalf_the_Grey.jpg",
    "url": "gandalf"
  }
]